{"text": "I start recording the slides for Magnetic Emails this week.  I've written 5 drafts of the course.  Why?  Because there is nothing worse than spending money on bloated material.  Excited to get this to you. https://t.co/3JJ4igp0GO", "label": "uninteresting_topic"}
{"text": "How many emails does it take for someone to buy?  After 20 cohorts of Ship 30, 10,000+ people enrolled, &amp; millions of dollars in revenue, we've found that number.  In this Coffee with Cole, I outline our entire launch email strategy.  Check it out here: https://t.co/J8LMmWoAVh https://t.co/2IZqi3myxX", "label": "uninteresting_topic"}
{"text": "I really enjoyed this book and was unexpectedly moved by it  I dont envy anything billionaires have or have to deal with, least of all their money, and didnt think Id learn much from it  But besides being a page turner, its actually about what it means, how it feels, and how https://t.co/JtXN8ZfaEn https://t.co/FAXl6PksVi", "label": "uninteresting_topic"}
{"text": "big news for https://t.co/NxtxOPYNKQ  - we've signed two new weekly sponsors for July - sold many pro launch packs - some remaining for July - are in talks w/ famous actors in the acquisition field - integrations &amp; partnerships  we love all makers, all creators, bootstrapped, https://t.co/hxvzpDQYoV", "label": "uninteresting_topic"}
{"text": "This is how I celebrate.  900 amazing people  In less than 6 months and 1-hr/day.  Thank you all so much!  Your continuous support and feedback is appreciated.  THANK YOU   And have an amazing day  https://t.co/41oFXNCLMW", "label": "interesting_topic"}
{"text": "Software engineering has changed dramatically over the last 12 months.  You are not going to make it if you continue to build everything from scratch or slowly vegetate in some large bureaucracy.  The new 10x engineer ships stuff at rocket speed, learns new topics and concepts https://t.co/oxqehRIdw8", "label": "interesting_topic"}
{"text": "Unplugging for a few days. https://t.co/F0ZJ6mVt9v", "label": "interesting_topic"}
{"text": "Over the past couple of months, Ive been taking CodeSignals Prompt Engineering for Everyone course.  I dont normally finish my courses all the way through, but this one had a key differentiator: an AI Tutor.  The future of online education should look like this: https://t.co/xrei6tUZh9", "label": "uninteresting_topic"}
{"text": "How do you avoid all the information noise and feeling overwhelmed?  I started writing better and more consistently when I built my first 'second brain' in Notion a few years ago. Tiago Forte, author of the Second Brain, has now released a new method called PARA.   Full guide  https://t.co/DGpqeO4zU6", "label": "interesting_topic"}
{"text": "I had a chat last night with a billion-dollar SaaS founder/CEO. He's raised $200M at a $2B valuation in 2021.  Living the high life in SF with a crazy house and a Porsche 911. On the surface, it seems like he has it all and living the dream.  But he called me out of the blue at https://t.co/EZVNMrNjuv", "label": "uninteresting_topic"}
{"text": "Do you like what your life will look like in 5 years if you continue down this path?", "label": "interesting_topic"}
{"text": "'It doesn't matter where you are coming from. All that matters is where you are going.' - Brian Tracy  You matter. Life matters. Now matters. Love matters. Truth matters. People matter. Health matters. Nature matters. Passion matters. Purpose matters. Freedom matters. Exploring https://t.co/vtWiLgP8cU", "label": "interesting_topic"}
{"text": "My first lead magnet was a huge waste of time.  I spent 50 hours building it, but when I launched, no one was interested.  Because I never validated the idea first.  Always sell before you build.", "label": "uninteresting_topic"}
{"text": "Indian Government Proposes Banning Driverless Cars!!   Instead of embracing technology, they would rather ban it so that drivers can keep their jobs!   This is a terrible idea! The whole idea behind technological progress is to let the machines do most of the heavy lifting! https://t.co/52yOl3MAEy", "label": "interesting_topic"}
{"text": "No, AI is not going to magically acquire consciousness.  You would have to train it with the express intent of giving it agency, self awareness and consciousness!   It will require a significant breakthrough to make that happen!", "label": "interesting_topic"}
{"text": "According to the judge, GitHub Copilot's code is not completely identical to the code generated by developers.  This is not the first Copilot case in which Microsoft wins.  I use Copilot daily (and I feel awful when it is unavailable.). I'm happy it's not going anywhere. https://t.co/gIruBVRAoV", "label": "interesting_topic"}
{"text": "I spent the morning sipping a cappuccino &amp; devouring @nateliason's new book Crypto Confidential.  Damn near had to clear the rest of my schedule for the day because I couldn't put it down.  Highly recommend you pick up a copy and read it for yourself! https://t.co/0WtN1AGSX5", "label": "uninteresting_topic"}
{"text": "Did anyone receive a special Amazon email notifying them of the release of my new book Simple Marketing for Smart People?  (Im trying to see if those go out only for primary authors, or also for co-authors)", "label": "uninteresting_topic"}
{"text": "OpenAI cuts China.  Right when the Chinese AI models are starting to surpass ChatGPT4. https://t.co/qIGWxkAgjW", "label": "uninteresting_topic"}
{"text": "WHAT A GOAL!!!   GO Lamine Yamal! ", "label": "uninteresting_topic"}
{"text": "What startups are you most bullish on?", "label": "uninteresting_topic"}
{"text": "Wow! What a show that was!   Still buzzing from todays Demo Day at @PaddleHQ AI Launchpad   The top 10 finalists got to pitch in front of a top-tier judging panel and a global audience live   The caliber of the pitches and demos has been insane   Everyone deserves a huge https://t.co/7wuVwWhX9s", "label": "uninteresting_topic"}
{"text": "10 topics all ghostwriting clients want to talk about:   Tips  Stats  Steps  Habits  Lessons  Mistakes  Examples  Questions  Resources  Trending Topics  Choose depending on the piece you're writing and what will be most valuable to your client's readers.", "label": "interesting_topic"}
{"text": "born too late to explore the earth  born too early to explore the stars  born at the right time to have a chunker with your name on it  cool work @atroyn @brandonstarxel  @trychroma and shoutout to @jamescalam https://t.co/qKUzqx7rIV", "label": "uninteresting_topic"}
{"text": "One of Airtable's weak spots was dealing with tasks and sub-tasks (at least for me).  But their Interface Designer is legit and solves a lot of those issues.  And their AI feature is actually fiya  https://t.co/JFMKhqNZY8", "label": "interesting_topic"}
{"text": "A sordid, scintillating tale of greed, power, hedonism, risk, and vast fortune  I highly recommend picking up @nateliasons new book to read the story yourself! https://t.co/IbVrMQlZhT", "label": "uninteresting_topic"}
{"text": "10 Free AI Courses  That will change your approach to AI &amp; work  //THREAD  Here's a curated lineup of free courses designed to help you master AI, no matter your experience level: https://t.co/CnJPvNUCCN", "label": "uninteresting_topic"}
{"text": "As an entrepreneur you gotta be ready to disrupt your own startup before someone else inevitably does.  If you think your product is perfect you're in trouble. Disrupting your own business means rethinking and reshaping your product or service to keep up with new market demands https://t.co/XOxfnzM98k", "label": "interesting_topic"}
{"text": "Whats causing all these  posts to look the same ?  Cut the fluff  Facts tell but stories sell  Storytelling is the best form of branding  Why ?  Because stories can:   Connect  Inspire  Relate  Its the best way to sell without making it feel like youre selling. https://t.co/ctASWIYjFw https://t.co/fzp4JzNqhC", "label": "interesting_topic"}
{"text": "How to prompt 10x faster with ChatGPT:  1. Click on your profile photo and press Customize ChatGPT 2. Paste the text below into the How would you like ChatGPT to respond section 3. Use those hotkeys when prompting https://t.co/mqLK9UztPJ", "label": "interesting_topic"}
{"text": "The idea behind Apple Intelligence is a stroke of genius!  They built a large foundation model and fine-tuned it on multiple tasks.  But they are doing something very clever:  They built adapters they plug into the large model to fine-tune it on the fly for specific tasks. https://t.co/O2Q0dgzgqY https://t.co/VJ3em3EpsZ", "label": "uninteresting_topic"}
{"text": "Once Elon realizes it's OFTEN needed  X will make YouTube sweat.  (4K option would be cool too) https://t.co/8Agpsquq7l", "label": "uninteresting_topic"}
{"text": "The entrepreneur diet:  10% water 10% Chicken 9% steak 5% Sleep 3% beans 70% Coffee", "label": "uninteresting_topic"}
{"text": "Theres no time.  That was my #1 excuse.  But I never lacked time.  I lacked priorities.  Want to get things done?  Focus on what really matters. https://t.co/aJuyypwHrI", "label": "interesting_topic"}
{"text": "My 3 favorite writers of the month:  - Dan Koe - Kieran Drew - Tim Denning  Love reading them before writing.  Find the Jedi masters that fit your style,  And become an apprentice.  Who are your favorites?", "label": "interesting_topic"}
{"text": "What do all entrepreneurs have in common?", "label": "interesting_topic"}
{"text": "Building a personal brand as a content creator has huge benefits. It helps you with establishing credibility, increasing visibility, and nurturing audience loyalty.   I've been expanding my content on the job site. Check out this article for a step by step guide. https://t.co/2lCgtxmtXe", "label": "interesting_topic"}
{"text": "Working without AI and automation in 2024 is like using a flip phone in 2014.", "label": "interesting_topic"}
{"text": "Summer 2024  Wednesdays on X 12pmEST  @hendoai @christel_occ + friends   Daybreak  https://t.co/xPAiEPJnTV", "label": "uninteresting_topic"}
{"text": "Here's your future:   1. remote workers piloting robots 2. robots will learn thanks to AI 3. autonomous robots who work 24/7.  So what is your purpose in 2030? https://t.co/TxPBrotsWi", "label": "uninteresting_topic"}
{"text": " New Tool Alert    Check out @PodScribeIO which is like  Second Brain For Podcasts   Today they are on @ProductHunt   Explore, try it out &amp; if you like it, show some love to the product    https://t.co/mQsjaTGUkn", "label": "uninteresting_topic"}
{"text": "I went 700 days without a sip of alcohol.   Learned a ton during the process &amp; it served me well.   Recently brought it back for two specific situations:   Wedding celebrations Wine pairings at world-class restaurants  Both of these are 100% worth it &amp; make the experience https://t.co/1nEXzd6cqA https://t.co/KiZqtmrmEJ", "label": "interesting_topic"}
{"text": "I still can't believe that I purchased:   Createsell (.com) domain.  I couldn't think of a better domain to build my next business on.  I have so many tasks on my backlog.  Expect everything that you asked for.  This will be super big, but it will take some time. https://t.co/c9xbMCR8Jk", "label": "uninteresting_topic"}
{"text": "Raise your rates, lower your stress.  Price is an amazing filter for shitty clients.", "label": "interesting_topic"}
{"text": "Last week, I got to sit down with Ciarn Doyle for my @NotionHQ podcast   Just got the video back from my editor and oh boy, this is a good one!  Super excited to share it later this week  https://t.co/yLQfmtbyZC", "label": "uninteresting_topic"}
{"text": "AI NEWS: OpenAI and Thrive just launched a hyper-personalized AI health coach.  Plus, big developments from Odyssey, Poe, Luma Labs, LivePortrait, NVIDIA, and Japan's Defense Ministry.  Here's everything going on in AI right now:", "label": "uninteresting_topic"}
{"text": "The single most important use case for AI :)   Nostalgia! Bring your old photos to life   h/t - visualfeastwang https://t.co/wVrOGxd42O", "label": "uninteresting_topic"}
{"text": "Trump says he will repeal Biden's executive order on AI!  This is extremely important as the EO is flawed and bans open-source AI! https://t.co/lUB0GjiIBU", "label": "uninteresting_topic"}
{"text": "The entrepreneur diet:  10% water 10% Chicken 9% steak 5% Sleep 3% beans 70% Coffee", "label": "uninteresting_topic"}
{"text": "Whenever you need to have a difficult conversation, whether with an employee, boss, or spouse.  Ask an LLM for advice...  You may not take the advice, but reading and meditating on the response will vastly improve how things go.  LLMs make hard things easy!! https://t.co/V6FvKacAYH", "label": "interesting_topic"}
{"text": "The fastest path to writing a single-click ChatGPT MEGA-prompt:  Chain Prompts   Break up complicated tasks  Customize and tweak each output  Edit and improve your prompting as you go  Once you have a result you likelump everything into one prompt.  Iteration is the way.", "label": "interesting_topic"}
{"text": "Whats the coolest AI product youve seen/ built lately?   (Founders: feel free to pitch your product below if its cool / helpful)", "label": "uninteresting_topic"}
{"text": "Fascinating report on the gender biases in GPTs  Interestingly, GPT-4 is biased against men... and thinks it's ok to abuse a man to prevent a nuclear apocalypse but not ok to abuse a woman!!  Of course, these LLMs were fine-tuned to reduce bias against women, but in doing so, https://t.co/oaHCODClfs https://t.co/HED9ezM73J", "label": "interesting_topic"}
{"text": "Python won because it reads like a novel.  Readability is a winning feature for any programming language.  Here is a subtle, small byproduct of having the ability to declare your variables and specify their type in Mojo .  You can't have this in Python. https://t.co/ROpiSCEFrx", "label": "uninteresting_topic"}
{"text": "In my experience... copy flows 100x smoother when you write the sales page while you build the product.  Deeper you are in the trenches, the more clearly you understand what benefits your audience cares about.", "label": "interesting_topic"}
{"text": "One of the things I love most about being a creator:  Going to the gym whenever I want.", "label": "interesting_topic"}
{"text": "Last year, Dickie and I invested $68,000 in a mastermind program. And beginning of this year, we re-upped and paid $68k again. This experience has completely changed my mindset of investing in myself. I'm now earmarking $100k/yr to programs &amp; experiments, just to learn.", "label": "interesting_topic"}
{"text": "If you can do one pull-up youve got above average strength for a male.", "label": "interesting_topic"}
{"text": "You keep looking at USA for AI. While China cooks TWICE as fast &amp; more.  More than half of the LLM models released to the world lately come from China.  Open your eyes.  Fun fact: also valid for humanoid robot developments. https://t.co/FytZTY7mQJ", "label": "uninteresting_topic"}
{"text": "I serve 90 clients with 90% profit margins.  I can do this because of how my offer is structured:  I don't monetize things with an Offer Suite.  I monetize access with an Offer Shell.  I recorded a 7-minute walkthrough.  Comment Shell before the end of the day for the link. https://t.co/IeicjzR0P5", "label": "uninteresting_topic"}
{"text": "Ive made well over $1M by writing online in the last year  Big chunk of that is my social media.  Im hosting a session to teach my secrets.  Starts today(!!)  Like + comment send for the registration link.  (Must be following) https://t.co/EKnBqsrn3D", "label": "uninteresting_topic"}
{"text": "True strength is pushing through when you feel like giving up.  Keep going, and you'll surprise yourself with how strong you really are! https://t.co/v7F4Mzszho", "label": "interesting_topic"}
{"text": "My new reel filming setup.  Time to film some reels. Time to get good traffic. Time to make a lot of sales. https://t.co/rwMrI7vPcd", "label": "uninteresting_topic"}
{"text": "Today I woke up and did not feel like writing.  This is extremely rare for me.  So  Heres what I did:  Walked down to a coffee shop. No way I was getting the work done if I stayed in my home environment. Too many distractions.  Told myself:  You only have to write one email. https://t.co/kJlAwspn9Y", "label": "interesting_topic"}
{"text": "Thanks so much Rob!!!", "label": "uninteresting_topic"}
{"text": "Ive been on X for 7 months.  I make $4500/mo.  Thats more than the average salary in my country.  And many of those poor people   studied for 5 years  hate their life  work 9-5s  This internet business thing is the way.  You joining us or nah?", "label": "interesting_topic"}
{"text": "Im building a custom Make app for @docsautomator.  DocsAutomator is my absolute favorite document generator.  It does a brilliant job of generating documents from Google Docs templates.  You can create invoices (with line items), contracts, proposals, you name it.  The app has a https://t.co/DElUWS7fU5 https://t.co/T3t8SCYPcD", "label": "uninteresting_topic"}
{"text": "My training for the week   Total running distance: 80km https://t.co/JsBiBLNnrx", "label": "uninteresting_topic"}
{"text": "This is Carl Jung.  In 1913, he founded Analytical Psychology.  From 1914 to 1930, he wrote 'The Red Book.' (The most controversial work in history of the unconscious mind)  Here are 13 mind-bending quotes from Jung that give me goosebumps... https://t.co/rAgGy3wm8I", "label": "uninteresting_topic"}
{"text": "Fine Tuning Tip   Your fine-tune typically becomes obsolete in a couple of months - i.e whenever a new SOTA base model is dropped!   Your best bet is to have a fine-tuning recipe and a quick evaluation module that you can rerun every time a new model is dropped   That way you can https://t.co/rxho8rWJ4S", "label": "interesting_topic"}
{"text": "3 types of tasks AI crushes:  1. Executing templates 2. Enhancing something already written 3. Synthesizing unstructured notes into a desired output  No 'thinking' requiredjust executing.", "label": "interesting_topic"}
{"text": "So fucking excited for where @founderos is headed.", "label": "uninteresting_topic"}
{"text": "Its been unusually quiet in the AI world!   I am expecting a slew of announcements next week!    We will definitely have a couple of super exciting ones but I suspect that we will have a bunch more!   I am ready for Sonnet 3.5 to be replaced by a new king! - Meta 400b!! ", "label": "uninteresting_topic"}
{"text": "If you order a burger and it's cold, do you eat it or send it back to get a new one?", "label": "uninteresting_topic"}
{"text": "Content creation is simple when you have systems.", "label": "interesting_topic"}
{"text": "How to take better photos than a filmmaker.  My takeaway from Jae.  Looking back,  The answer's obvious.  She does what I write about now:  She got better by posting.  Photos upon photos.  The reps added up,  And the skill compounded.  Best part?  She's a nurse.  And said I made https://t.co/GJXlxV3tcB https://t.co/Pf74q7cfak", "label": "uninteresting_topic"}
{"text": "Making LLMs actually work in production is 10x harder than making a cool demo!   You can make a cool demo or a prototype overnight!   The challenge is to get the LLM to be reliable, talk to the right systems, get the security and permissions right,  blah blah blah.    Over https://t.co/HdPisUiDtG", "label": "interesting_topic"}
{"text": "I'm raising the price to join Cash Creators tomorrow.  Join my list and I'll get you the invite at the current price: https://t.co/IHZYot9v3q", "label": "uninteresting_topic"}
{"text": "Sundays are for repenting for our sins with Bulgarian Split Squats. https://t.co/rBnmkKYZv4", "label": "uninteresting_topic"}
{"text": "Sharp Sundays https://t.co/5GPLKAVG9e", "label": "uninteresting_topic"}
{"text": "We built an app that changes the online writing game..  And paired it with our best curriculum yet to help beginners &amp; creators:  - Write content faster - Avoid writer's block - Generate follow-worthy ideas on demand  Enrollment closes at midnight tonight: https://t.co/9lrWlncDG1", "label": "uninteresting_topic"}
{"text": "The prompting GOD paper:  24 pages of tested AI research to get the MAXIMUM output from AI.  //THREAD  I went through it &amp; here are the TOP 9 principles you NEED to know: https://t.co/RxbUdofdOB", "label": "interesting_topic"}
{"text": "UX improvements on https://t.co/NxtxOPYfVi  voting while unauthenticated now opens to signin modal  - what do you think of 'supervotes' - what do you think of anon 'downvotes'  i don't want ML to sound like Reddit, nore like Tinder.. https://t.co/FEE2bGoKoq https://t.co/gzXNv9oGpX", "label": "uninteresting_topic"}
{"text": "A simple way to improve your copywriting (without copywriting): https://t.co/ci65fE2bDD", "label": "uninteresting_topic"}
{"text": "Meet Jane.  Jane is in luxury real estate &amp; she wanted to create a successful body to go with her successful business.  Stoked to say that in one full year, we were able to drop 74 lbs   Now she has so much energy &amp; confidence that shes running laps around her competition. https://t.co/0JqBaQY6sJ", "label": "uninteresting_topic"}
{"text": "If LinkedIn was a person: https://t.co/lTB1TdB1Fz", "label": "uninteresting_topic"}
{"text": "I posted my first tweet 222 days ago.  I had nothing.   0 ideas    0 followers    0 experience  But now, my life has changed.      3369 cool people   a job that I really love  over $10000 wifi money   What happened?  I told stories.  That's genuinely it.  Stories win https://t.co/W7xDbJAbKD", "label": "interesting_topic"}
{"text": "I recently started using Claude much more.  More than GPT-4o.  People really need to try different models to see what works for them.  Here are 7 amazing use cases that will inspire you to try something different than GPT-4o: https://t.co/4kmgBpJfe9", "label": "interesting_topic"}
{"text": "Observation:  People already have the marketing material they need. The problem is that they feel like it's too 'simple' or 'mundane'.  They're too close to their work to see how interesting it can be to outsiders.", "label": "interesting_topic"}
{"text": "I've spent 3 years studying how to grow on YouTube.   And I've learned that anybody can hit 100k subscribers.  Here are the 11 steps (in less than 3 minutes): https://t.co/Uf04syipdF", "label": "uninteresting_topic"}
{"text": "How I turn 1 idea into 12 pieces of content in 10 minutes:  I run it through the Endless Idea Generator.  Here's how it works: https://t.co/eM2TzoRlbg", "label": "interesting_topic"}
{"text": "My Twitter schedule is simple:  Schedule 28 tweets on Saturday (2 hours).  Write 1 long form Monday-Friday (30 mins).  Reply to all my comments every day (15 mins).  Do the math.  That's less than 1 hour per day (on average).  Tell me again why you don't have time?", "label": "interesting_topic"}
{"text": "Here is the video where I built an AI assistant who sees and listens to me.   It's all Python. It's only a few lines of code. Video has step-by-step instructions on how to do the same.  Great example of what you could do with today's tech. https://t.co/9JPQZHV7Xz", "label": "uninteresting_topic"}
{"text": "1/ Close  2/ Go on a walk 3/ Let ideas run wild 4/ Get back to your desk 5/ Brain-dump for 10 minutes 6/ Turn ideas into content 7/ Thank me later", "label": "interesting_topic"}
{"text": "No-Code x AI Bootcamp 10 is about to start!  Build an MVP of your AI app in 25 days! Founders of Zapier, Softr &amp; Glide as guest instructors. Amazing stuff with @HainingMax @hdkstr @100daysnocode @100daysai (I'm an instructor too!)  Enrolment closes in 20 hourssee reply below. https://t.co/gqsdUdKgCg", "label": "uninteresting_topic"}
{"text": "Another Sunday with jazz &amp; espresso.  Just me &amp; ChatGPT. Competing with teams of 10 people. Figuring out:  - copywriting - community - automation - workshops - newsletter - prompting - marketing - AI agents - branding - mental sanity - sales - ads - X.  Easy. How's your Sunday? https://t.co/TZulJ0Pv7W", "label": "interesting_topic"}
{"text": "question, would you guys run Ads on this?  - is something missing? - wording: 'popular' vs. 'early bird' - should I set a max limit on pro slots? - sponsorships: weekly vs. monthly?  does something come to your mind?  https://t.co/uvOQmnaux0 https://t.co/hg62FRdNbS https://t.co/lfBdeIO4Vp", "label": "uninteresting_topic"}
{"text": "I made $97 in my first 3 months of X.  But I became a full-time creator the next month.  All you need is 1 good offer.", "label": "interesting_topic"}
{"text": "The 2 easiest ways to improve energy levels:  1) Drink water 2) Go for a walk  Lack of hydration leads to brain fog.   Lack of movement leads to low energy.   Do both and your body and brain will thank you.", "label": "interesting_topic"}
{"text": "Working my way to 20 strict, paused chin ups @ 210 lbs.   Knocked out a clean set of 12 today.   Trying to add a rep each month for the rest of the year. https://t.co/GD3pcam3wY", "label": "interesting_topic"}
{"text": "Why should everyone try entrepreneurship?  Because of the joy of freedom.   Someday, you will work 4 hours.  Some days, it's 12 hours.  But  The best part  You own your time.  It's up to you when to work and for how long.  And it's called freedom. https://t.co/eSAeBtvhNv", "label": "interesting_topic"}
{"text": "Just hit the 6th month mark on X today.  Things were pretty wild:   1550+ followers  A $12k/month business  Over 1,800,000 impressions  Clients hitting $10k+ months and $14k days  Working with 2 7-figure CEOS to build out their new biz  All while working a 9-7 as well. https://t.co/wxbttHCaRv", "label": "interesting_topic"}
{"text": "I come from a working-class village in the north of England.  I love home, but the attitude there is awful. Everyone is pessimistic. Nobody leaves their hometown. If someone starts making money, they judge them for showing off.   Most people are stuck in an endless cycle of https://t.co/3e26PfX5SD", "label": "interesting_topic"}
{"text": "Exercise daily for a healthier mind and body. Even a short walk can boost your mood and energy levels. https://t.co/kjwa8953l7", "label": "interesting_topic"}
{"text": "I hit 15,000 followers today.   Daily writing  Daily building  Daily learning  Keep it simple.", "label": "interesting_topic"}
{"text": "This just killed my writer's block.  With 1 change in my routine:  Write AFTER 30-60min of reading.  Results   8-10 posts in 1 hour,  Half of them long forms.  Recommend if your creativity needs a power boost.", "label": "interesting_topic"}
{"text": "You'd be surprised at how little these 'big accounts' actually make.", "label": "interesting_topic"}
{"text": "My last 3 days were wild:   Hit 6,000 followers  $1,200+ from a simple $29 E-Book  Finished first draft of my flagship course  And...  I even snuck a few G&amp;Ts into the mix.  Business is best when balanced.", "label": "interesting_topic"}
{"text": "GM Makers! Coffee mode  Updating/extending my punchline for https://t.co/NxtxOPYfVi this morning  my shortlist A - 'Launch, get feedback and first sales' (current)  B - 'Products loved and used by makers'  C - 'Unfair startup advantages: products, trends, deals' D - https://t.co/POLiLuRiFb https://t.co/FzFnLZFVuE", "label": "uninteresting_topic"}
{"text": "This is Marketing by Seth Godin is one of my most highlighted books.   It surprises me when an entrepreneur tells me they havent read it. His philosophy on how to build your brand and business gives you an incredible edge. https://t.co/fLSxIrTx3H", "label": "interesting_topic"}
{"text": "I love X.  It's allowed me to   build a $4000/mo biz  work entirely from home  meet like-minded friends  We complain too much about the algo  But forget how blessed we are with this opportunity.", "label": "interesting_topic"}
{"text": "Make Pro Tip  If an app has API connection points but isnt integrated with Make, you can still use it in your automations by:  1. Using an HTTP module or 2. Building a custom Make app https://t.co/lWNc0ygrWp", "label": "interesting_topic"}
{"text": "Wake up Scroll on IG Get dressed Stuck in traffic Do work you hate Survive for 8 hours Stuck in traffic again Finally come how exhausted Skip the gym and watch Netflix Consume cheap dopamine to cope Scroll phone mindlessly and go to bed  Repeat.  This is what keeps me motivated.", "label": "interesting_topic"}
{"text": "Marketing is all about observing what works and what doesnt    Then tailoring your campaign to those discoveries    Same goes for content marketing  It's always going to be a plane field when a new strategy works", "label": "interesting_topic"}
{"text": "I can teach you more in 2 minutes than you'll learn in 4 years.  Here are 11 steps to start your own business: https://t.co/dP9n2JMiQD", "label": "uninteresting_topic"}
{"text": "Part of what gets me excited about working on fitness is .. its very much like entrepreneurship   Its a marathon .. with delayed gratification   Helps you really think and plan for long term results while putting in daily reps  It also trains your brain to focus on you vs you https://t.co/wNcy3nDVbB", "label": "interesting_topic"}
{"text": "Gemma-2 27b beats Llama-3 70b and Qwen-2 72b on key benchmarks on livebench ai!   Its a beast for its size and gives Googles best model Gemini-1.5 a run for its money  Who would have thought Googles best work will be in the open source arena  https://t.co/DvdoEcKkR2", "label": "uninteresting_topic"}
{"text": "'Asymmetric opportunities: Invest in startups Start a company Create a book, podcast, video Create a (software) product Go on many first dates Go to a cocktail party Read a Lindy book Move to a big city Buy Bitcoin Tweet.'  @naval", "label": "interesting_topic"}
{"text": "I use this habit to solve any problem:  1. Before bed, write down 1 big question or problem I'm trying to solve  2. Wake up and journal on it first thing for 30 minutes  May be confirmation bias, but my subconscious working on the problem overnight leads to huge morning clarity.", "label": "interesting_topic"}
{"text": "People overcomplicate networking.  1) Find 20 interesting posts. 2) Say what you felt about it. 3) DM the person you liked their writing.  And want to say hi.  It only gets hard when you stop acting human.", "label": "interesting_topic"}
{"text": "'The modern mental illness is anxiety. The symptom is inability to fall asleep. The evidence is pills, meditation apps, opioids, and sleep trackers. The causes are oversocialization and overstimulation.'  @naval", "label": "interesting_topic"}
{"text": "If you had $5k/mo to spend on your fitness, what would you invest in?", "label": "interesting_topic"}
{"text": "The most important issue of our times is preventing premature AI regulation   AI regulation will ban open-source and with it wipe out the start up ecosystem. We will be left with a handful of players with whom power will be concentrated!   This will in turn lead to oligopolies, https://t.co/DPKCyWBMjx", "label": "interesting_topic"}
{"text": "The best way to comment on Twitter is to either:   Share a personal experience  Be a complete menace  No one is interested in reading yet another wow, what an amazing insight! comment.  Leave that for the LinkedIn losers.", "label": "interesting_topic"}
{"text": "The biggest money cheat code is following your obsession.", "label": "interesting_topic"}
{"text": "It's 10 PM. Saturday. They all left.  Actually the office has been empty all day. Only me here...  Me and that voice: 'It's not enough.'  I don't know how to make the presentation for New York 'smarter'.  I ran it through Sonnet, Gemini, GPT4o multiple times.  It's not enough. https://t.co/Qy5TDecNQO", "label": "uninteresting_topic"}
{"text": "No Youtube video today.  Decided to switch to a biweekly schedule so I can make the videos 10x better.  Next video will be out next Saturday... and it's going to be the best thing I've ever created (thanks to @kortexco). https://t.co/YRS1ndnW0e", "label": "uninteresting_topic"}
{"text": "'If you create it for yourself, its art. If you create it for others, its business.'  @naval", "label": "interesting_topic"}
{"text": "Anyone know @RyanHoliday who can introduce me?  To connect generally, and to ask him to speak at our upcoming Second Brain Summit!", "label": "uninteresting_topic"}
{"text": "Shoutout to the team that built https://t.co/z0no9modnp . Really neat site that benchmarks the speed of different LLM API providers to help developers pick which models to use. This nicely complements the LMSYS Chatbot Arena, Hugging Face open LLM leaderboards and Stanford's HELM https://t.co/QTJ3bwi20L", "label": "uninteresting_topic"}
{"text": "https://t.co/4jndagEBzm", "label": "uninteresting_topic"}
{"text": "95% of my ghostwriting clients had the same 'voice':   To the point  No harsh language  No flowery language  Minimal industry jargon  Simple and easy to understand  Formal tone without being verbose  Most of the time, they just wanted to sound confident.", "label": "uninteresting_topic"}
{"text": "3 distinct benefits of writing with AI:  1. Takes the grunt work off your plate  2. Gives you head-tilting / hadn't thought of that ideas  3. Trained in tasks that'd take you 1,000 hrs to learn  When you outsource the doing to AI, you ascend in leverage.", "label": "interesting_topic"}
{"text": "Finally, we have our feedback awards for https://t.co/NxtxOPYNKQ June  Made gpt-4o work pretty hard on this one, our category winners are:  Funniest: @eliasstravik about Boilerplatehub - With two wins, Janu is now an overlord on Microlaunch.  Most helpful: @Bayang_BM about https://t.co/WvqtEJ98f0 https://t.co/IkB2R36GeC", "label": "uninteresting_topic"}
{"text": "We dont live in a meritrocracy  We live in a trustocracy  What I mean is .. if youre talented and feel like you can build really amazing things but frustrated that no one is giving you a chance .. you are confused   Your talent is useless if you dont build trust   Trust is https://t.co/1pNSMRTzFU", "label": "interesting_topic"}
{"text": "Pokemon on the R1 https://t.co/buTc56oeOx", "label": "uninteresting_topic"}
{"text": "flipping software is the new trend.  just like real estate  buy a property renovate it filp it for 2x profit  or like trading.  buy low hold sell high  same is happening with software.  buy a dying startup renovate it market it for better audience sell it for 3x on Acquire. com", "label": "uninteresting_topic"}
{"text": "If you struggle to find new ideas, hear me out:  Yes, everything has been said before.  But no, not by you.", "label": "interesting_topic"}
{"text": "Sometimes you only realise when you've already started that it's not as bad as you expected.", "label": "interesting_topic"}
{"text": "Leveraging AI and Tech has been proven solid for our agency and our clients.  You save them time.  You save them money.  You provide them value.  You build trust.  On calls with prospect, I keep recommending tools, frameworks to make their business future proof.", "label": "interesting_topic"}
{"text": "AI agents aren't perfect yet, but they don't  - build empires - burnish their resumes  - play political games  - have convenient sick days  - insist on re-inventing the wheel again and again - take months to get something done  As AI agents become more reliable, more and more https://t.co/XMlYDmmAdg", "label": "interesting_topic"}
{"text": "'Escape competition through authenticity.'  @naval", "label": "interesting_topic"}
{"text": "Saturday ship for revid .ai  Pick a generation preset + specify a general style   My fav: MORE MORE MORE MORE EXAGGERATED    https://t.co/vbVtJ3nWh5", "label": "uninteresting_topic"}
{"text": "WhatsApp has more than 2.6 billion users.  Meta AI is rolling out to every WhatsApp user.  Here's how to use Meta AI effectively. https://t.co/inqtYqIkQO", "label": "uninteresting_topic"}
{"text": "F*ck working 24/7.  We went on a date in the countryside.  -Lovely weather -Lovely place -Lovely women  Feeling super refreshed. See you all tomorrow.  Happy weekend. https://t.co/NQhvogIz7R", "label": "interesting_topic"}
{"text": "Cash Creators is opening in 2 days one last time before the $2,600 price raise.  You can join through my list today and get an early invite.  Join here: https://t.co/IHZYot9v3q", "label": "uninteresting_topic"}
{"text": "Somehow deadlifts are easier   But this is more fun &amp; memorable https://t.co/mviT3psyFa", "label": "uninteresting_topic"}
{"text": "Here's a powerful prompt to optimize your work schedule and help you get more work done.  It will:   Ask you 3 questions about your current role, responsibilities, and tasks  Assess what your maker vs manager time balance should be  Suggest 2 optimized schedules based on https://t.co/uPtjJvgrdq https://t.co/AgMHaSDCGO", "label": "interesting_topic"}
{"text": "Another good writing tip from David Ogilvy:  Write the way you talk.  'Finding your writing voice' is a waste of time.  You already have your voice - the one you use every day.   Choose a topic  Record yourself talking about it  Transcribe it  Then, start from there. https://t.co/K9MOf1VBoW", "label": "interesting_topic"}
{"text": "Finally did my due diligence and got Make and Glide certified. https://t.co/roQSW4wf0z", "label": "uninteresting_topic"}
{"text": "You attract lower quality leads by showing them how to turn what they don't have into something they do.  You attract high quality leads by showing them how to turn something they have into something they don't. https://t.co/9agpb3lKV3", "label": "uninteresting_topic"}
{"text": "Great quote from Kung Fu Panda 3 (2016):  If you only do what you can do, you will never be more than you are now. https://t.co/0pnkJSM9Ra", "label": "uninteresting_topic"}
{"text": "My students are making $100-$300/day online  (without selling their time or sending DMs)  Now, I'm sharing exactly how they did it...   Want it free?   Like &amp; reply 'TRIP' and I'll send it to you  [Must be following to get DM  36 hours only] https://t.co/MEeTEimAsG", "label": "uninteresting_topic"}
{"text": "Building a process map for your Second Brain reveals how your knowledge, tasks and tools connect, making it easier to identify gaps, manage and optimize your information flow  I love this example that Jordan shared inside our BASB Facebook group https://t.co/RykSICCsrU", "label": "uninteresting_topic"}
{"text": "How to become a smart entrepreneur https://t.co/7SlwuO0V6h", "label": "uninteresting_topic"}
{"text": "One of my favourite quotes for building an online business:  If you find what you love before the results roll in, youll be unstoppable when they do.   Jack Butcher  It took me a year to hit 1,000 followers and 18 months to make one dollar.   But I was having so much fun https://t.co/fDY3IExJlP", "label": "interesting_topic"}
{"text": "I suck at jetlag.  I traveled from Ukraine to Guatemala last week in the span of 3 days.  Arrived at midnight.  Woke up at 3AM.  And it took me 3 days to fully settle into the new timezone.  Not exactly in tiptop shape.  But thats ok because my Model doesn't need me to be. https://t.co/uAs1n0mRmh https://t.co/e8SWaMYGiH", "label": "uninteresting_topic"}
{"text": "you don't need 100K followers to start making an impact.  i have more dream clients coming to me than i can handle. and i'm able to see them coming because my inbox is still manageable.  plus, working with them 1-to-1 enables crazy results: https://t.co/FSSz8rLeOL", "label": "interesting_topic"}
{"text": "dark mode v2 iteration for https://t.co/NxtxOPYfVi 'choose your launch pack' modal  i want to keep it - minimalistic - clear value - w/ good conversion ratio  how does it look? any advice/feedback? https://t.co/x0HuSEiNsl", "label": "uninteresting_topic"}
{"text": "Do you agree? Give me a  in the comment section below if youre with me. And TAG someone you respect. Deeply. https://t.co/b9EAFiCjLU", "label": "uninteresting_topic"}
{"text": "It's easy for me to write copy because I write honest copy.  I simply tell a story that already happened. I relive conversations with clients. I don't speculate about the future. I just share the past so that I can save people the hassle of verifying the proof.  I am the proof.", "label": "interesting_topic"}
{"text": "Im obsessed with creating systems.  Sadly, most people have no idea where to start or how to do it successfully.   Thats why I created Founder OS.   Here are 10 ways Founder OS helps founders scale to $5M profit a year: https://t.co/PPrsWgkwGB", "label": "uninteresting_topic"}
{"text": "Ever wondered what you get when you mix Gary Vee with Toni Morrison?  (Me neither, actually.)  But what if you could steal other writing styles and add them to your writing toolkit?   Here's the 'Instant Writing Remixer' I created with ChatGPT (with the exact prompts I use): https://t.co/ABjcHPwoY8", "label": "interesting_topic"}
{"text": "Most successful solopreneurs I know:  - Aren't that smart - Don't have MBAs - Don't come from money  They are just regular ol' people with a lot of confidence and a heavy bias for action.  Take one action step this weekend.", "label": "interesting_topic"}
{"text": "Applied for a 9-5 job, but quit on the same day.  Then broke started selling:  1. E-Commerce (100% profit) 2. Websites ($100/project) 3. Design ($1,000/project) 4. UI/UX ($10,000/project) 5. Digital products ($39,000/month)  Nothing makes sense until it does. https://t.co/Wci198pOiL", "label": "uninteresting_topic"}
{"text": "Even after 4 years, $100k, and 180k followers.  I still:   Deal with imposter syndrome  Take hours to write my content  Second guess my product launches  If it scares you  it means you're on the right path.", "label": "interesting_topic"}
{"text": "Im 42 years old.  And I'm building a personal brand to:   Quit my 9-5  Retire my family  Have more free time  Travel + live anywhere  Enjoy every day to its fullest  In other words  freedom  Whats your WHY ? https://t.co/C2ga3WZtpR https://t.co/hZhtQxglXP", "label": "interesting_topic"}
{"text": "Every Saturday I write 28 tweets in under 2 hours.  Then I schedule those across the week.  Why?  I like my mental peace.  And waking up worrying what to tweet about 7 days per week doesn't align with that.", "label": "interesting_topic"}
{"text": "Want to make more money?  Learn copywriting.  Want to get more followers?  Learn copywriting.  Want to get better at dating?  Learn copywriting. (for real)  Copywriting is the meta-skill you need.", "label": "interesting_topic"}
{"text": "In the future, the world will be much more careful about scrolling social media.   Modern-day cigarettes.", "label": "interesting_topic"}
{"text": "https://t.co/7A0aaBlO2F", "label": "uninteresting_topic"}
{"text": "To the AI 'educators' out there:  Your tutorials should benefit the students, not the teacher. Cut the garbage AI tools affiliate shilling, help the people.  A trustworthy reputation will pay 10x more than the affiliate peanuts.", "label": "interesting_topic"}
{"text": "The Full Stack Creator is the future.  1. Learn a skill 2. Build an audience 3. Sell a service 4. Create a system 5. Productize your knowledge 6. Teach your audience 7. Stack new skills 8. Unlock new opportunities  A game of infinite leverage.", "label": "interesting_topic"}
{"text": "Digital freedom is easier than you think.  $5,000 per month is enough for time freedom.  So solve a $1,000 problem for 5 people.", "label": "interesting_topic"}
{"text": "gm folks, this one had to happen i guess silly me, I should sleep more..  lot of cool stuff to ship for https://t.co/NxtxOPYfVi this weekend, who's building too? https://t.co/iXdDoPTj6k", "label": "uninteresting_topic"}
{"text": "Amsterdam weather looked dreary this week, so I popped over to Croatia   Will spend the next few weeks bouncing between my notebook, my laptop, the gym, and the ocean  I love working on the internet https://t.co/AhW59mmrkB", "label": "uninteresting_topic"}
{"text": "Most people do not take writing seriously enough.  The quality of your business is directly related to the quality of your writing. Writing is a magnet for opportunitiesa force multiplier for success.   Commit to the craft.   You won't regret it.", "label": "interesting_topic"}
{"text": "I cracked the code.  Here's how you can scale ANY online business:  1. Post content on socials 2. Funnel people to an email list 3. Nurture them on there 4. Run an email campaign 5. Funnel them to a sales page  BABAAAM!  Here comes the moneyyyy (dolla dolla).", "label": "interesting_topic"}
{"text": "I just came across this mind-blowing psychological trick I can't stop experimenting with...  The Ben Franklin Effect: https://t.co/Ko1LeLqYGl", "label": "uninteresting_topic"}
{"text": "True self-confidence comes from doing uncomfortable things time after time, eventually realising that it wasn't that bad in the first place.", "label": "interesting_topic"}
{"text": "I've been there...  Scared to try, scared to fail. Scared of humiliation, scared of judgement. Scared of worst-case scenarios, what ifs and if thens.  What got me through this fear?  Understanding the missed potential and the regrets for not pursuing my dreams.", "label": "interesting_topic"}
{"text": "Can I make $1,000,000 in 10 years?", "label": "interesting_topic"}
{"text": "I think that If you can genuinely solve your prospects problems    You can differentiate yourself from the noise by putting out content that makes you stand out  It all starts with clarity and understanding", "label": "interesting_topic"}
{"text": "i've basically stopped fine tuning, and most of you should too  literally wasted a months of eng work only to have a new model drop that makes our fine tunes obsolete   it only makes sense when your product has PMF", "label": "uninteresting_topic"}
{"text": "Personal life first. Personal brand second.  Authenticity is key.  But do it wrong, it's the lock.   Vulnerability is good, oversharing is not.", "label": "interesting_topic"}
{"text": "One of the most underrated productivity tips:  Plan your day in advance.  Instead of waking up overwhelmed with things to do, you wake up with clarity.  Sometimes, its the difference between a good day and a bad day.", "label": "interesting_topic"}
{"text": "Challenge your limits daily.  Break free from comfort zones and discover the amazing potential within you.", "label": "interesting_topic"}
{"text": "California sure is nice at times. Hello from Santa Barbara. The latest from @LumaLabsAI makes nice scenes of my son, Ryan.   Instagram doesnt do this from a video (I just walked around my son shooting a video then uploaded it to Luma).  https://t.co/wwVBexGUUB https://t.co/dB3kqaqm1H", "label": "uninteresting_topic"}
{"text": "'The ideal life would be one where you had a hobby that as a byproduct made you money, you had a hobby that as a byproduct kept you healthy, you had a hobby that as a byproduct made you smarter and more creative.'  @naval", "label": "interesting_topic"}
{"text": "Just picked up Ray Kurzweils new book The Singularity Is Nearer  Hes stuck unfailingly to his prediction that the singularity will happen by 2045 for 20 years now, and its incredible how much more plausible that seems today versus just a few years ago https://t.co/rNEapvA4jU", "label": "interesting_topic"}
{"text": "Have you heard about the upcoming Second Brain Summit Im hosting in October?", "label": "uninteresting_topic"}
{"text": "Sometime between 30-40 years old, every extrovert suddenly gets more introverted  They always think their life is over, that theyve lost their spark, that something is deeply wrong with them  As an introvert, I can tell you the fun is only beginning ", "label": "interesting_topic"}
{"text": "'Fantastic advice: '@cdixon: If you aren't getting rejected on a daily basis, your goals aren't ambitious enough.''  @naval", "label": "interesting_topic"}
{"text": "AI Assistant With Custom Instructions Makes For A  Great Teacher!!  Learning using an LLM can be highly effective. You can set custom instructions and tell the LLM to explain complex things clearly.  With ChatLLM, now available as an app both on Android and iPhone, you can set https://t.co/c9S9tLbq0T https://t.co/YeifWeMINU", "label": "interesting_topic"}
{"text": "I stopped posting later on Fridays as engagement drops off.  But I've just put my headphones on, cued up a mix of Elvis and Sinatra in YouTube Music, and now I've got a few emails to critique.  After that a movie or two if I've got time.  Enjoy your weekend!", "label": "uninteresting_topic"}
{"text": "I integrated Glasp with Notion to create a full content repurpose system for my Weekend Start Up curriculum.   I also integrated Text Makeover GPT with Glasp to automate the transcript &gt; beautiful content process.   This is amazing.   Try Text Makeover   And if you missed the https://t.co/cw4IAr8er5 https://t.co/bkPUXj3rx9", "label": "interesting_topic"}
{"text": "Just crossed 100M impressions for the year  Let me teach you how to do this in my next free masterclass:  ***3 Simple, Recyclable Social Media Frameworks Everyone Should Know***  Like + comment send for the link https://t.co/Gh8ykKg8Ou", "label": "uninteresting_topic"}
{"text": "I am a huge fan of learning by doing, but this seems like a great free book about deep learning.  If you are looking for a stellar weekend reading, this could be it   https://t.co/SkSm9cTIj8", "label": "uninteresting_topic"}
{"text": "Your website traffic is meaningless if nobody buys.  Recently, I helped a friend boost conversions 27% with a simple change.  Tomorrow, I'm sharing my 5-4-3-2-1 method for creating irresistible offers.  Join 220K to get the issue tomorrow: https://t.co/HM6RnrwvxI", "label": "uninteresting_topic"}
{"text": "Ways to improve as a writer:   Practice in public  Pay attention to engagement data  Read other smart writers  Ways to NOT improve as a writer:   Take 'audience building' courses  Edit the same piece 10 times  Don't publish until it's 'perfect'", "label": "interesting_topic"}
{"text": "In late 2020, I stumbled into ghostwriting.  I used it to unlock business opportunities, communities, and mentorship.  Today, I live a life I only *dreamed* of 3 years ago.  This is why I believe being a ghostwriter is the best career decision for anyone interested in writing.", "label": "uninteresting_topic"}
{"text": "For those who are constantly chasing the latest paper claiming the greatest results:  Please, don't. https://t.co/5FDmoNqOmL", "label": "interesting_topic"}
{"text": "I used to hate editing too.  But if you build a checklist it gets 100x easier. And a lot more fun when you start polishing sentences into sticky statements and paragraphs into slippery slides. https://t.co/XZvb58dvHd", "label": "uninteresting_topic"}
{"text": "'All self-help boils down to 'choose long-term over short-term.'  @naval", "label": "interesting_topic"}
{"text": "I gained 91 followers in the last 5 days  It started as an experiment  But then it escalated  Here's what I did: https://t.co/exV3HjJ5xg https://t.co/wJCugXzPEW", "label": "uninteresting_topic"}
{"text": "AI, Love, Lasagna, 300 Million Dollars  Enjoy. Surprising ending.  Thoughts?  (yes, $300M funding, Moshi AI) https://t.co/uytAVKNDHm https://t.co/XhQgwTHvtC", "label": "uninteresting_topic"}
{"text": "You'll upgrade your phone countless times before realizing the best app is putting it down and enjoying the moment.", "label": "uninteresting_topic"}
{"text": "You can run all of your Python code in Mojo .  You can also import any Python library. The whole ecosystem is available to Mojo from day 1.  This is probably the most critical feature that will make Mojo successful.  Here is how it works: https://t.co/xC0SQNTbxf", "label": "uninteresting_topic"}
{"text": "mastery requires constant iteration.  if you create something then leave it alone...  you'll never compete with someone who's adding their best thinking to it day after day.", "label": "interesting_topic"}
{"text": "This year, I stopped being busy.  And spent more time building systems than working.  Here's Why:  Systems scale. Systems outlast hustle. Systems allow long-term thinking.  Sweat In the lab not in the warehouse.", "label": "interesting_topic"}
{"text": "When it comes to growth and monetization don't expect 'instant' results.  Monetization is a long-term game.  Play it with a plan and patience.", "label": "interesting_topic"}
{"text": "Ready to become an AI-powered Ghostwriter?  I spent 50+ hours creating a Prompt Vault to help you:   Find a lucrative niche  Craft an Irresistible Offer  Ghostwrite *anything* for *anyone*  Want access?  Like &amp; reply ''I'll send it to you for FREE! https://t.co/3v3RgDKz5E", "label": "uninteresting_topic"}
{"text": "The best writers aren't the best. They just wrote a lot.", "label": "interesting_topic"}
{"text": "“Only associate with people where you don’t have to drink to be around them.”  @naval", "label": "interesting_topic"}
{"text": "AI agents need a lot of orchestration, authentication and tooling. The Abacus Enterprise platform makes it super simple for you to create Agents, connect to different apps and data sources and manage maintain permissions. Using a platform is the way to go here, trying to", "label": "uninteresting_topic"}
{"text": "Believe it or not - There is an open-source model that beats the latest Gemini model... very handily in both reasoning and code. We will be releasing more details on the state of open-source soon!!", "label": "uninteresting_topic"}
{"text": "The. first AI-generated commercial! This one is from Sora. I suspect Toy-r-us made it so it can benefit from the buzz and hype of everyone sharing itThis one has a very uncanny valley vibe, so it's not quite as compelling. The Kling MadMax beer one was much better.", "label": "uninteresting_topic"}
{"text": "Deepseek Coder v2 Is The New Open-Source King And Beats The Best Gemini Model. Deepseek-coder has officially put OSS in third position, just behind OAI and Anthropic. It excels at coding and reasoning and scores very high on Livebench AI, the ONLY benchmark you can't game!", "label": "uninteresting_topic"}
{"text": "Several people seem frustrated that they can't use the web or generate images using Sonnet 3.5 You can do this with ChatLLM. Don't tell our engineering team about this post; they will be mad at me! We are running hot...\n\n", "label": "uninteresting_topic"}
{"text": "There will be two classes of people in the future.\n\nThe LLM savvy and the LLM clueless\n\nThe LLM savvy will understand the strengths of different LLMs, will know how to apply them in their jobs and personal lives, use them prolifically, and experience huge career and productivity gains.\n\nThe LLM clueless class will barely know what is happening, claim AI is dangerous, and slowly become obsolete.\n\nThere will be a great divide between these two classes. Even bigger than the rich and the poor of today", "label": "interesting_topic"}
{"text": "Top people set clear goals:\n\n• They outline what they want\n• The write everything down\n• They make detailed plans\n• They track their progress\n\nUnsuccessful people leave it all in their head\n\nAnd let their head talk themselves out of it...", "label": "interesting_topic"}
{"text": "LLMs Are Great Levelers!\n\nGoogle search up-skilled millions and helped us level up to the so called experts of yester years.\n\nYou could instantly fact check them in minutes, prove or dis-prove them and go toe to toe!\n\nLLMs take this up a notch and uplevel our skills - from basic English speaking to coding and expert research, LLMs equalize the playing field!\n\nOverall this is a big deal for our entire species. We will no longer have a huge resource constraint on stellar talent as more people move from the above average bracket into the expert bracket and from the beginner bracket to the mid-level overnight!", "label": "interesting_topic"}
{"text": "Give information. Monetize personalization.", "label": "interesting_topic"}
{"text": "Over the last 6 months, we have seen\n\nAI generated\n\n- audiobooks\n- influencers on instagram\n- commercials\n- songs\n- novels\n- proteins\n- documents\n- reviews, SEO content farms\n- code and agents\n\nThe quality of these generated artifacts is as good, if not better than what humans are able to produce!\n\nThis is just in the last 6 months! Imagine what happens in the next 2 years", "label": "interesting_topic"}
{"text": "Content 101:\n\nWhat worked last week, may not work today.\n\nIf your content is not evolving, it’s dying.", "label": "interesting_topic"}
{"text": "I failed many times before I could make my first dollar on the internet.\n\nDon't quit while you fail in first attempt:\n\n10 no's = closer to a yes.\n10 flops = closer to a win.\n10 mistakes = closer to mastery.\n\nKeep failing forward.", "label": "interesting_topic"}
{"text": "I don't know who needs to hear this.\nBut when you're faced with a decision to make – choose the one that creates change.\nThat's how you grow beyond what you think you're capable of.", "label": "interesting_topic"}
{"text": "solopreneurship isn ' t about constantly working on your business. it ' s about building a business that works for you.", "label": "interesting_topic"}
{"text": "Both Microsoft and Amazon have been very disappointing and far behind when it comes to foundation models!\nEven Nvidia, a hardware player, dropped a very good OSS model Nemotron, a couple of weeks ago.\nTheir reliance on OAI and Anthropic will cripple them in the long run. FWIW", "label": "uninteresting_topic"}
{"text": "I know many multi-six-figure creators.\n• One used to be a dentist\n• One used to be a bartender\n• One used to be a music teacher\n• One used to live in a trailer park\nDon't let the start of your story\nDictate who you'll become in the end", "label": "interesting_topic"}
{"text": "Fall in love with the problem, not your solution.", "label": "interesting_topic"}
{"text": "Daily writing straightline your thoughts.\n\nI used to mumble a lot, but now I talk in a logical and structured manner.\n\nThose frameworks are now stuck inside my head.\n\nIt's the ultimate tool to sharpen your thinking.", "label": "interesting_topic"}
{"text": "Your niche is created, not found\n\nWhen you:\n\n• Find an obsession\n• Learn as much as you can\n• Share everything you're learning\n• And help as many people as possible\n\nYou'll build a life that never needs a resume ever again", "label": "interesting_topic"}
